
## :x: Apply Failed (github)

[CI link](https://github.com/nasa9084/infrastructure/actions/runs/13434603773)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
github relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure/infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure/infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/nasa9084/github/runs/run-QqQZHb8g3Rnmt9YR

Waiting for the plan to start...

Terraform v1.7.3
on linux_amd64
Initializing plugins and modules...
github_repository.dotfiles_secret: Refreshing state... [id=dotfiles-secret]
github_repository.blog_web_apps_tech: Refreshing state... [id=blog.web-apps.tech]
github_repository.mastering_go_std_packages_2: Refreshing state... [id=mastering-go-std-packages-2]
github_repository.nasa9084: Refreshing state... [id=nasa9084]
github_repository.go_switchbot: Refreshing state... [id=go-switchbot]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.mastering_go_std_packages: Refreshing state... [id=mastering-go-std-packages]
github_repository.nasa9084_github_io: Refreshing state... [id=nasa9084.github.io]
github_repository.gmac: Refreshing state... [id=gmac]
github_repository.gmail_resource: Refreshing state... [id=gmail-resource]
github_repository.infrastructure: Refreshing state... [id=infrastructure]
github_repository.nasa9084_github_io: Drift detected (update)
github_repository.gmac: Drift detected (update)
github_repository.go_switchbot: Drift detected (update)
github_repository.blog_web_apps_tech: Drift detected (update)
github_repository.dotfiles: Drift detected (update)
github_repository.infrastructure: Drift detected (update)
github_repository.nasa9084: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.exporter_web_apps_tech will be created
  + resource "github_repository" "exporter_web_apps_tech" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "exporter.web-apps.tech"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + pages {
          + build_type = "workflow"
          + cname      = "exporter.web-apps.tech"
          + custom_404 = (known after apply)
          + html_url   = (known after apply)
          + status     = (known after apply)
          + url        = (known after apply)

          + source {
              + branch = "gh-pages"
              + path   = "/"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

github_repository.exporter_web_apps_tech: Creating...
╷
│ Error: POST https://api.github.com/user/repos: 403 Resource not accessible by integration []
│ 
│   with github_repository.exporter_web_apps_tech,
│   on repository_exporter_web_apps_tech.tf line 1, in resource "github_repository" "exporter_web_apps_tech":
│    1: resource "github_repository" "exporter_web_apps_tech" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":71,"Program":"tfcmt","SHA1":"d7f23d5fe8ea21ac25a298d447147e647c4c0c93","Target":"github","Vars":{},"WorkflowName":"Terraform Apply"} -->